const riddles = [
    {
        "_id": 1,
        "question": {
            "title": "חידת כובעים",
            "content": `
            ישנם 5 כובעים. 3 שחורים. 2 לבנים.
    על הראש של שלושה אנשים חובשים כובע ושני כובעים מחביאים בצד.
    האנשים מסודרים בשורה כך שכל אחד יכול לראות את הכובעים שלפניו אבל לא את הכובע שלו או את הכובעים שמאחוריו.
    האנשים נשאלו איזה כובע יש להם על הראש?
    הראשון ענה: אני לא יודע.

    השני ענה: אני לא יודע

    והשלישי ענה: אני כן יודע.

    איך ייתכן שהאיש השלישי ידע איזה כובע יש לו על הראש?
            `
        },
        "answer": `
        אם הראשון אמר "לא יודע", אז זה אומר שלפחות לאחד מהאנשים שממולו יש כובע שחור.
כי אם שני הכובעים שממלו היו לבנים, הוא היה יודע שהוא שחור (כי יש רק שני לבנים).

אם השני אמר "לא יודע", אז זה אומר שהוא רואה שחור.
מכיוון שאם הוא היה רואה לבן, הוא היה יודע שהוא שחור, כי הראשון בוודאות לא ראה שני לבנים.

לכן השלישי יודע שהוא שחור.
        `,
        "img": "",
        "subject": "סימטריה",
        "date_created": ""
    },
    {
        "_id": 2,
        "question": {
            "title": "מטבעות שחורים לבנים",
            "content": `
            אתה נמצא בחדר חשוך שבו אתה לא רואה כלום.
ישנו שולחן בחדר שבו 100 מטבעות. מצד אחד המטבעות שחורים ומצד שני המטבעות לבנים.
90 מהם הפוכים על צידם השחור ו10 מהם הפוכים על צידם הלבן.
עליך להוציא שתי קבוצות של מטבעות שבכל קבוצה תהיה כמות שווה של מטבעות לבנים.

איך תעשו זאת?
            `
        },
        "answer": `
        ניקח 10 מטבעות אקראיים מתוך ה100, נהפוך אותם וזאת תהיה קבוצה אחת.
        הקבוצה השנייה תהיה המטבעות הנותרים.
 
הסבר:
בקבוצה אחת יש 10 מטבעות אקראיים שאותם הפכנו ובקבוצה השנייה יש 90 שאותם לא הפכנו.
 
כעת נחלק למקרים:
אם 10 המטבעות שלקחנו, כולם היו לבנים – אחרי שהפכנו אותם, בשתי הקבוצות יהיו לנו 0 מטבעות לבנים.
אם 10 המטבעות שלקחנו, כולם היו שחורים – אחרי שהפכנו אותם, בכל אחת מהקבוצות יהיו לנו 10 מטבעות לבנים.
 
 
אם לקחנו מספר שונה של מטבעות לבנים ושחורים אז:
נסמן ב-X  את מספר הלבנים שנלקחו לקבוצה ראשונה.
ולכן לקחנו לקבוצה הראשונה : X מטבעות לבנים, ו- X-10 מטבעות שחורים.
בקבוצה השנייה נותרו: 10-X מטבעות לבנים.
כאשר נהפוך בקבוצה הראשונה את המטבעות, נקבל כי כעת יש : X  מטבעות שחורים ו-X-10 מטבעות לבנים.
כלומר קיבלנו שיש X-10 מטבעות לבנים בקבוצה הראשונה וגם בקבוצה השנייה.
 
לכן בכל 10 מטבעות אקראיים שנבחר, לאחר שנהפוך אותם תהיה אותה כמות של מטבעות בשתי הקבוצות.

        `,
        "img": "",
        "subject": "סימטריה",
        "date_created": ""
    },
    {
        "_id": 3,
        "question": {
            "title": "דובר אמת ושקר",
            "content": `
            באי נידח באוקיינוס השקט חיים זה לצד זה שני שבטים. שבט דוברי האמת,
            שתמיד דוברים אמת ושבט השקרנים, שתמיד תמיד משקרים.
            תייר שהסתובב באי הגיע לשביל המתפצל לשניים והיה עליו להחליט
            לאן לפנות כדי להגיע חזרה למלונו. לעזרתו באו שני מקומיים, אחד
            משבט דוברי האמת ואחד משבט השקרנים. הוא הסתפק בשאלה אחת
            לאחד מהם ולפי התשובה ידע לאן לפנות. מה הייתה שאלתו?
            `
        },
        "answer": `
        הוא ישאל : "אם אני ישאל את האיש השני מה הדרך חזרה מה הוא יענה לי ?"
        אם הוא ישאל את זה את דובר האמת אז הוא יגיד לו מה הדרך הלא נכונה כי זאת התשובה שהשקרן יגיד כי הוא משקר
        ואם הוא ישאל את השקרן אז הוא גם יגיד לו את הדרך הלא נכונה כי דובר האמת אמור להגיד לו
        את הדרך הנכונה אבל בגלל שהוא שקרן הוא יגיד לו את הדרך הלא נכונה
        וככה הוא צריך ללכת הפוך ממה שהם אומרים.
        `,
        "img": "",
        "subject": "",
        "date_created": ""
    }

];

module.exports = riddles;
